W10D4/Reddit/app/models/user.rb

    def self.generate_session_token
        token = SecureRandom::urlsafe_base64
        while User.exists?(session_token: token)
---
SELECT  1 AS one FROM "users" WHERE "users"."session_token" = $1 AND "users"."id" != $2 LIMIT $3  [["session_token", "Z80w8Za2bwoS5bPfKDfscw"], ["id", 4], ["LIMIT", 1]]