W10D4/Reddit/app/controllers/comments_controller.rb

INSERT INTO "comments" ("post_id", "user_id", "content", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["post_id", 13], ["user_id", 4], ["content", "jknkjn"], ["created_at", "2019-11-15 00:24:18.506461"], ["updated_at", "2019-11-15 00:24:18.506461"]]
---
    def create
        @comment = current_user.comments.new(comment_params)
        if @comment.save