W10D4/Reddit/app/controllers/posts_controller.rb

INSERT INTO "posts" ("title", "content", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "yuh"], ["content", "yuhhhhh"], ["user_id", 4], ["created_at", "2019-11-14 22:38:53.358138"], ["updated_at", "2019-11-14 22:38:53.358138"]]
---
    def create
        @post = current_user.posts.new(post_params)
        if @post.save