W10D4/Reddit/app/controllers/subs_controller.rb

    def create
        @sub = current_user.subs.new(sub_params)
        if @sub.save
---
INSERT INTO "subs" ("title", "description", "moderator_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "sdc"], ["description", "sdcsdcs"], ["moderator_id", 3], ["created_at", "2019-11-14 21:29:14.664943"], ["updated_at", "2019-11-14 21:29:14.664943"]]

    def update
        @sub = Sub.find(params[:id])
        if @sub.update(sub_params)
---
SELECT  "subs".* FROM "subs" WHERE "subs"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "subs" SET "title" = $1, "description" = $2, "updated_at" = $3 WHERE "subs"."id" = $4  [["title", "Sub 1"], ["description", "This is the first sub."], ["updated_at", "2019-11-14 21:35:34.045219"], ["id", 1]]