W8D2/URLShortener/app/models/shortened_url.rb

INSERT INTO "shortened_urls" ("long_url", "short_url", "submitter_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["long_url", "google.com"], ["short_url", "VC6ME33ymGlZwXXmHSG2_g"], ["submitter_id", 1], ["created_at", "2019-10-29 23:30:59.426717"], ["updated_at", "2019-10-29 23:30:59.426717"]]
---
    def self.create_short_url!(user, long_url)
        ShortenedUrl.create!(
            long_url: long_url,
            submitter_id: user.id,
            short_url: ShortenedUrl.random_code
        )

SELECT 1 AS one FROM "shortened_urls" WHERE "shortened_urls"."short_url" = $1 LIMIT $2  [["short_url", "VC6ME33ymGlZwXXmHSG2_g"], ["LIMIT", 1]]
---
    def self.random_code
        loop do
            random_url = SecureRandom::urlsafe_base64
            return random_url unless ShortenedUrl.exists?(short_url: random_url)