W10D4/Reddit/app/views/posts/show.html.erb

<ul>
    <% @post.comments.each do |comment| %>
---
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = $1  [["post_id", 13]]