W10D4/Reddit/app/views/subs/show.html.erb

SELECT "posts".* FROM "posts" INNER JOIN "post_subs" ON "posts"."id" = "post_subs"."post_id" WHERE "post_subs"."sub_id" = $1  [["sub_id", 2]]
---
<ul>
    <%= @sub.posts.each do |post| %>